In [1]:
import pandas as pd
import numpy as np

In [5]:
d = { "Col1":["p","p","q"] , "Col2" : ["x","y","z"],"Col3" :["a","b","c"] }
df = pd.DataFrame(d)
df

  Col1 Col2 Col3
0    p    x    a
1    p    y    b
2    q    z    c

In [18]:
pd.value_counts(df["Col1"])    # we can get the values count in col

C:\Users\sdara\AppData\Local\Temp\ipykernel_9220\2157171375.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(df["Col1"])    # we can get the values count in col

Col1
p    2
q    1
Name: count, dtype: int64

In [22]:
d = {"Name": ["Sehan","Ranil","Anura"] , "Marks" : [75,90,100] , "Class" : ["AL","OL","Campus"]}
df = pd.DataFrame(d,index=["a","b","c"])
df

    Name  Marks   Class
a  Sehan     75      AL
b  Ranil     90      OL
c  Anura    100  Campus

In [24]:
df.columns
# returnt the columns only

Index(['Name', 'Marks', 'Class'], dtype='object')